<a href="https://colab.research.google.com/github/VensaHerald/titania/blob/master/titania.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import files
import io
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
url = "https://raw.githubusercontent.com/VensaHerald/titania/master/train.csv"
df_t = pd.read_csv(url)
df_t.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Did more men or women die on the Titanic

In [6]:
df_t[df_t["Survived"]==0]["Sex"].value_counts()

male      468
female     81
Name: Sex, dtype: int64

In [7]:
df_t[df_t["Age"].isna()].shape[0]/df_t.shape[0]

0.19865319865319866

###What was the average age of those who died, and those who survived?
Before I can answer this, I need to sort out the data. From the above cell we can see that there are 20% rows missing age data.  So I will need to drop these from the dataset before beginning

In [14]:
df_dr_age = df_t.dropna(subset=["Age"])
df_dr_age[df_dr_age["Age"].isna()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

Now these values have been dropped we can look at this column in more detail